wiki/FitNesseRoot/HsacExamples/SlimTests/HttpTests/HttpPost1Test.wiki

!2 Body in Wiki

Send a HTTP POST supplying the content to post in a variable so the script table does not have newlines in its cells.

!define POST_BODY { {{{
<s11:Envelope xmlns:s11="http://schemas.xmlsoap.org/soap/envelope/">
  <s11:Body>
    <ns1:AddInteger xmlns:ns1="http://tempuri.org">
      <ns1:Arg1>10</ns1:Arg1>
      <ns1:Arg2>11</ns1:Arg2>
    </ns1:AddInteger>
  </s11:Body>
</s11:Envelope>
}}} }

|script         |xml http test                                                           |
|set value      |${ACTION}      |for header                           |SOAPAction        |
|post           |${POST_BODY}   |to                                   |${URL}            |
|check          |response status|200                                                     |
|show           |response                                                                |
|show           |response headers                                                        |
|register prefix|tempuri        |for namespace                        |http://tempuri.org|
|check          |xPath          |!-//tempuri:AddIntegerResult/text()-!|21                |
